{
  "date": "2026-02-01",
  "title": "What's New in Sitepins — January 2026",
  "tags": ["Features", "Improvements", "Bug Fixes"],
  "image": "https://sitepins.com/images/blog/product-updates/what-new-sitepins-2026.png",
  "details": "We kicked off 2026 with some major updates — focused on removing friction, enhancing collaboration, and giving you more control over your workflow.\n\n## 100+ Pre-configured Templates\n**What:** Over [100+ pre-configured templates](https://app.sitepins.com/templates) built with Astro, Hugo, and Next.js by Themefisher and Gethugothemes.\n\n**Why:** Choose a template and start editing immediately — no setup required, one click and you're ready to go.\n\n## Deploy to Vercel\n**What:** Direct Vercel deployment from Sitepins with automatic sync for every content change.\n\n**Why:** Connect your repo to Vercel directly from Sitepins. Every change triggers a rebuild automatically — no manual builds, no deployment steps.\n\n## GitLab Repository Support\n**What:** Sitepins now supports GitLab repositories in addition to GitHub.\n\n**Why:** Teams using GitLab for CI/CD can now integrate Sitepins without changing their existing workflows.\n\n## Multiple Branching Support\n**What:** Full GitHub branch management — create branches, open PRs, and merge directly from Sitepins.\n\n**Why:** Experiment and review changes without affecting production. Developers stay in control while non-technical teammates collaborate freely.\n\n## Email-based Access\n**What:** Grant access using only an email address — no GitHub or GitLab account required.\n\n**Why:** Clients and non-technical teammates can now edit content without needing a Git account.\n\n## Improved SEO Suggestions\n**What:** Better SEO recommendations with slug editing, SERP preview, content/link analysis, and best practice guardrails.\n\n**Why:** Keeps content optimized and prevents broken links or poorly formatted URLs during editing.\n\n## UI/UX Revamp\n**What:** Refined interface with consistent left-side navigation, clearer layout, and better organization.\n\n**Why:** Project switching is simpler, settings are easier to find, and the overall experience is smoother.\n\n## Global Search (Cmd/Ctrl + K)\n**What:** Search across your entire repository with a keyboard shortcut.\n\n**Why:** For large sites, finding the right file instantly saves significant time.\n\n## Media File & Folder Rename\n**What:** Rename media files and folders directly within Sitepins.\n\n**Why:** Better file naming improves organization, SEO, and long-term maintainability.\n\n## Bug Fixes\n- Fixed cursor positioning when switching between Markdown and Rich Text editor modes\n- Resolved extra HTML entities being added when using shortcodes\n- Fixed AI suggestions appearing across the entire document instead of only selected text\n- Corrected plan name not updating after purchase or trial activation\n- Fixed content not rendering due to schema mismatches"
}
